data source https://www.kaggle.com/c/titanic/data

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('w01-titanic.csv')

In [28]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [29]:
!mkdir w01-ans

mkdir: cannot create directory ‘w01-ans’: File exists

# Q1:
Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.

**a: 577 314**

In [30]:
cnts = data.Sex.value_counts()
with open('w01-ans/q1.txt', 'w') as fd:
    fd.write('{} {}'.format(cnts.male, cnts.female))

# Q2:
Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

**a: 38.38**

In [31]:
survivors_perc = '{:.2f}'.format(len(data[data.Survived == 1]) / len(data) * 100)
with open('w01-ans/q2.txt', 'w') as fd:
    fd.write(survivors_perc)

# Q3:

Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [32]:
firstclass_perc = '{:.2f}'.format(len(data[data.Pclass == 1]) / len(data) * 100)

In [33]:
with open('w01-ans/q3.txt', 'w') as fd:
    fd.write(firstclass_perc)

# Q4:
Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.

In [34]:
age_mean_median = '{:.2f} {}'.format(data.Age.mean(), data.Age.median())
age_mean_median

'29.70 28.0'

In [35]:
with open('w01-ans/q4.txt', 'w') as fd:
    fd.write(age_mean_median)

# Q5:
Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [36]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [37]:
corr = data[['SibSp', 'Parch']].corr().loc['Parch', 'SibSp']
corr_ans = '{:.2f}'.format(corr)
corr_ans

'0.41'

In [38]:
with open('w01-ans/q5.txt', 'w') as fd:
    fd.write(corr_ans)

# Q6:
Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.